# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Programação Funcional
#+Author: Prof. Lucas M. Schnorr (UFRGS)
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{../org-babel.tex}
#+LATEX_HEADER: \usepackage{color,colortbl}
#+LATEX_HEADER: \definecolor{gray98}{rgb}{0.98,0.98,0.98}
#+LATEX_HEADER: \definecolor{gray20}{rgb}{0.20,0.20,0.20}
#+LATEX_HEADER: \definecolor{gray25}{rgb}{0.25,0.25,0.25}
#+LATEX_HEADER: \definecolor{gray16}{rgb}{0.161,0.161,0.161}
#+LATEX_HEADER: \definecolor{gray60}{rgb}{0.6,0.6,0.6}
#+LATEX_HEADER: \definecolor{gray30}{rgb}{0.3,0.3,0.3}
#+LATEX_HEADER: \definecolor{bgray}{RGB}{248, 248, 248}
#+LATEX_HEADER: \definecolor{amgreen}{RGB}{77, 175, 74}
#+LATEX_HEADER: \definecolor{amblu}{RGB}{55, 126, 184}
#+LATEX_HEADER: \definecolor{amred}{RGB}{228,26,28}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \lstset{ %
#+LATEX_HEADER:  backgroundcolor=\color{gray98},    % choose the background color; you must add \usepackage{color} or \usepackage{xcolor}
#+LATEX_HEADER:  basicstyle=\tt\prettysmall,      % the size of the fonts that are used for the code
#+LATEX_HEADER:  breakatwhitespace=false,          % sets if automatic breaks should only happen at whitespace
#+LATEX_HEADER:  breaklines=true,                  % sets automatic line breaking
#+LATEX_HEADER:  showlines=true,                  % sets automatic line breaking
#+LATEX_HEADER:  captionpos=b,                     % sets the caption-position to bottom
#+LATEX_HEADER:  commentstyle=\color{gray30},      % comment style
#+LATEX_HEADER:  extendedchars=true,               % lets you use non-ASCII characters; for 8-bits encodings only, does not work with UTF-8
* Motivar a necessidade da abordagem funcional

Arquivo que usa =-99= para representar valores ausentes.

#+begin_src R :results output latex :session :exports both
library(tidyverse)
library(xtable);
set.seed(42)
df <- data.frame(
    replicate(6, sample(c(1:10, -99), 6, rep = TRUE)))
names(df) <- letters[1:6];
xtable(df, size="\\small")
#+end_src

#+RESULTS:
#+BEGIN_EXPORT latex
% latex table generated in R 3.3.3 by xtable 1.8-2 package
% Sun Sep  3 20:50:07 2017
\begin{table}[ht]
\centering
\begin{tabular}{rrrrrrr}
  \hline
 & a & b & c & d & e & f \\ 
  \hline
1 & -99.00 & 9.00 & -99.00 & 6.00 & 1.00 & 9.00 \\ 
  2 & -99.00 & 2.00 & 3.00 & 7.00 & 6.00 & 9.00 \\ 
  3 & 4.00 & 8.00 & 6.00 & 10.00 & 5.00 & 5.00 \\ 
  4 & 10.00 & 8.00 & -99.00 & 2.00 & 10.00 & 8.00 \\ 
  5 & 8.00 & 6.00 & -99.00 & -99.00 & 5.00 & 1.00 \\ 
  6 & 6.00 & 8.00 & 2.00 & -99.00 & 10.00 & 10.00 \\ 
   \hline
\end{tabular}
\end{table}
#+END_EXPORT

*Objetivo*: substituir =-99= por =NA=. Como fazer?

* #1: Funções anônimas

Declarando

#+begin_src R :results output :session :exports code
function(x) x*x
#+end_src

#+Latex: \vfill

Todas as funções tem =formals=, =body=, e um =environment=.

#+begin_src R :results output :session :exports both
formals( function(x) x*x )
body( function(x) x*x )
environment( function(x) x*x )
#+end_src

#+RESULTS:
: $x
: x * x
: <environment: R_GlobalEnv>
* Chamando funções anônimas
É obrigatório o uso dos parênteses
- Para chamar a função
- Para passar argumentos

#+Latex: \vfill\pause

#+begin_src R :results output :session :exports both
( function(x) x*x ) (2)
# faz a mesma coisa que o seguinte
f <- function(x) x*x
f(2);
#+end_src

#+RESULTS:
: [1] 4
: [1] 4
* Investigando a implementação de /closures/

#+begin_src R :results output :session :exports both
square
#+end_src

#+RESULTS:
: function(x) {
:     x ^ exponent
:   }
: <environment: 0x55d41594eec8>

#+begin_src R :results output :session :exports both
cube
#+end_src

#+RESULTS:
: function(x) {
:     x ^ exponent
:   }
: <environment: 0x55d41594e178>

#+BEGIN_CENTER
O que mudou?
#+END_CENTER

* Verificando o _escopo/ambiente_ de /closures/

#+begin_src R :results output :session :exports both
as.list(environment(square))
#+end_src

#+RESULTS:
: $exponent
: [1] 2

#+begin_src R :results output :session :exports both
as.list(environment(cube))
#+end_src

#+RESULTS:
: $exponent
: [1] 3

* Estado mutável

Modificar valores no ambiente do pai; permite criar estados mutáveis.
- Uma /closure/ leva consigo o _escopo/ambiente_ de onde foi definida.

#+begin_src R :results output :session :exports both
new_counter <- function() {
  i <- 0
  function() {
    i <<- i + 1
    i
  }
}
counter_one <- new_counter()
counter_two <- new_counter()
counter_one()
counter_one()
counter_two()
#+end_src

#+RESULTS:
: [1] 1
: [1] 2
: [1] 1

